РезервированиеТоваров/DataProcessors/ПодборНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ПодборНоменклатуры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
	</DataProcessor>
</MetaDataObject>

РезервированиеТоваров/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

РезервированиеТоваров/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

РезервированиеТоваров/AccumulationRegisters/РЗ_ЗарезервированныеТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РЗ_ЗарезервированныеТовары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетПокупателю</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

РезервированиеТоваров/AccumulationRegisters/РЗ_ПотребностьВТоварах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РЗ_ПотребностьВТоварах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетПокупателю</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

РезервированиеТоваров/DataProcessors/ПодборНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура РЗ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Перем ТекстЗапросаПроверка, ТекстЗапросаНовый;
	
	ТекстЗапросаПроверка = "ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	ХозрасчетныйОстатки.Счет КАК СчетУчета
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних({(&ДатаЦены)}, {(Номенклатура).* КАК Ссылка, (ТипЦен) КАК ТипЦен, (Валюта) КАК Валюта}) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО СправочникНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки({(&ДатаОстатки)}, {(Счет).* КАК Счет}, {(&ВидыСубконто)}, {(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Номенклатура)).* КАК Номенклатура, (Субконто2)}) КАК ХозрасчетныйОстатки
	|		ПО СправочникНоменклатура.Ссылка = ХозрасчетныйОстатки.Субконто1
	|			И (ХозрасчетныйОстатки.КоличествоОстаток > 0)}
	|ГДЕ
	|	НЕ СправочникНоменклатура.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА &ПоказыватьТолькоОстатки
	|				ТОГДА ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток, 0) > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|{ГДЕ
	|	СправочникНоменклатура.Ссылка.* КАК Номенклатура}";
	
	ТекстЗапросаНовый = "ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	ХозрасчетныйОстатки.Счет КАК СчетУчета,
	|	ЕСТЬNULL(ЗарезервированныеТовары.КоличествоОстаток, 0) КАК КоличествоЗарезервировано,
	|	ЕСТЬNULL(ПотребностьВТоварах.КоличествоОстаток, 0) КАК КоличествоПотребность
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних({(&ДатаЦены)}, {(Номенклатура).* КАК Ссылка, (ТипЦен) КАК ТипЦен, (Валюта) КАК Валюта}) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО СправочникНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки({(&ДатаОстатки)}, {(Счет).* КАК Счет}, {(&ВидыСубконто)}, {(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Номенклатура)).* КАК Номенклатура, (Субконто2)}) КАК ХозрасчетныйОстатки
	|		ПО СправочникНоменклатура.Ссылка = ХозрасчетныйОстатки.Субконто1
	|			И (ХозрасчетныйОстатки.КоличествоОстаток > 0)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РЗ_ЗарезервированныеТовары.Остатки({(&ДатаОстатки)}, ) КАК ЗарезервированныеТовары
	|		ПО СправочникНоменклатура.Ссылка = ЗарезервированныеТовары.Номенклатура
	|			И (ВЫБОР
	|				КОГДА &СчетНаОплатуПокупателю = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЗарезервированныеТовары.СчетПокупателю <> &СчетНаОплатуПокупателю
	|			КОНЕЦ)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РЗ_ПотребностьВТоварах.Остатки({(&ДатаОстатки)}, ) КАК ПотребностьВТоварах
	|		ПО СправочникНоменклатура.Ссылка = ПотребностьВТоварах.Номенклатура
	|			И (ВЫБОР
	|				КОГДА &СчетНаОплатуПокупателю = НЕОПРЕДЕЛЕНО
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ПотребностьВТоварах.СчетПокупателю = &СчетНаОплатуПокупателю
	|			КОНЕЦ)}
	|ГДЕ
	|	НЕ СправочникНоменклатура.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА &ПоказыватьТолькоОстатки
	|				ТОГДА ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток, 0) > 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|{ГДЕ
	|	СправочникНоменклатура.Ссылка.* КАК Номенклатура}";
	
	Если Не ПустаяСтрока(СтрЗаменить(СписокНоменклатуры.ТекстЗапроса, ТекстЗапросаПроверка, "")) Тогда
		ТекстОшибки = НСтр("ru='Текст запроса выборки номенклатуры изменился';");
		Сообщить(ТекстОшибки);
		ЗаписьЖурналаРегистрации("Обслуживание.Совместимость расширения", УровеньЖурналаРегистрации.Ошибка, Метаданные.Обработки.ПодборНоменклатуры,, ТекстОшибки); 
	КонецЕсли;
	
	СписокНоменклатуры.ТекстЗапроса = ТекстЗапросаНовый;

	МассивДобавляемыхРеквиизтов = Новый Массив;
	МассивДобавляемыхРеквиизтов.Добавить(Новый РеквизитФормы("СчетНаОплатуПокупателю", Новый ОписаниеТипов("ДокументСсылка.СчетНаОплатуПокупателю"),,, Ложь));
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквиизтов);
	
	Если Параметры.Свойство("СчетНаОплатуПокупателю", ЭтаФорма.СчетНаОплатуПокупателю) Тогда
		СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("СчетНаОплатуПокупателю", ЭтаФорма.СчетНаОплатуПокупателю);
	Иначе
		СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("СчетНаОплатуПокупателю", Неопределено);
	КонецЕсли;
	
	ЭлементРезерв = Элементы.Добавить("Зарезервировано", Тип("ПолеФормы"), Элементы.СписокНоменклатуры);
	ЭлементРезерв.ПутьКДанным = "СписокНоменклатуры.КоличествоЗарезервировано";
	ЭлементРезерв.Заголовок = НСтр("ru='Зарезервировано';");
	
	ЭлементПотребность = Элементы.Добавить("Потребность", Тип("ПолеФормы"), Элементы.СписокНоменклатуры);
	ЭлементПотребность.ПутьКДанным = "СписокНоменклатуры.КоличествоПотребность";
	ЭлементПотребность.Заголовок = НСтр("ru='Потребность';");
	ЭлементПотребность.Видимость = ЗначениеЗаполнено(ЭтаФорма.СчетНаОплатуПокупателю);
	
КонецПроцедуры
